# -*- coding: utf-8 -*-
"""
Created on Tue Nov 25 23:54:24 2025

@author: User
"""

x1 = int(input('Введите 1-ю сторону 1-го прямоуг.: '))
y1 = int(input('Введите 2-ю сторону 1-го прямоуг.: '))
 
x2 = int(input('Введите 1-ю сторону 2-го прямоуг.: '))
y2 = int(input('Введите 2-ю сторону 2-го прямоуг.: '))
 
x3 = int(input('Введите 1-ю сторону 3-го прямоуг.: '))
y3 = int(input('Введите 2-ю сторону 3-го прямоуг.: '))
 
print(f'Площадь 1-го: {x1*y1}')
print(f' Площадь 2-го: {x2*y2}')
print(f' Площадь 3-го: {x3*y3}')